# Chapter 2: System Architecture

## Operating System Model

- Windows is similar to most UNIX systems in that it’s a **monolithic** OS in the sense that the bulk of the OS and device driver code **shares the same kernel-mode** protected memory space.
- Here is a simplified version of this architecture: <p align="center"><img src="./assets/usermode-vs-kernelmode.png" width="500px" height="auto"></p>
- The four basic types of user-mode processes are described as follows:
  - Fixed (or hardwired) **system support processes**, such as the logon process and the Session Manager, that are not Windows services.
  - **Service processes** that host Windows services, such as the _Task Scheduler_ and _Print Spooler_ services. Services generally have the requirement that they run independently of user logons.
  - **User applications**, which can be one of the following types: Windows 32-bit or 64-bit, Windows 3 1 16-bit, MS-DOS 16-bit, or POSIX 32-bit or 64-bit. Note that 16-bit applications can be run only on 32-bit Windows.

- Most executive-level objects encapsulate one or more kernel objects, incorporating their kernel-defined attributes.
- The executive uses kernel functions to create instances of kernel objects, to manipulate them, and to construct the more complex objects it provides to user mode

### Kernel Processor Control Region and Control Block (KPCR and KPRCB)

- The kernel uses a data structure called the **kernel processor control region**, or KPCR, to store processor-specific data:
  - IDT, TSS, GDT.
  - interrupt controller state, which it shares with other modules, such as the ACPI driver and the HAL.
  - can be accessed via fs/gs register on 32bit/64bits Winsows system correspondingly.
  - On IA64 systems, the KPCR is always located at `0xe0000000ffff0000`
- KPCR also contains an embedded data structure called the **kernel processor control block** or KPRCB.
  - is a private structure used only by the kernel code in Ntoskrnl.exe
  - contains scheduling information such as the current, next, and idle threads scheduled for execution on the processor
  - the dispatcher database for the processor (which includes the ready queues for each priority level)
  - the DPC queue
  - CPU vendor and identifier information (model, stepping, speed, feature bits);
  - CPU and NUMA topology (node information, cores per package, logical processors per core, and so on)
  - cache sizes
  - time accounting information (such as the DPC and interrupt time); and more
  - also contains all the statistics for the processor, such as I/O statistics, cache manager statistics, DPC statistics, and memory manager statistics
  - sometimes used to store cache-aligned, per-processor structures to optimize memory access, especially on NUMA systems
    - For example, the nonpaged and paged-pool system look-aside lists are stored in the KPRCB.

```c
0: kd> !pcr
KPCR for Processor 0 at fffff80002c4a000:
    Major 1 Minor 1
	NtTib.ExceptionList: fffff80000b95000
	    NtTib.StackBase: fffff80000b94000
	   NtTib.StackLimit: 0000000000000000
	 NtTib.SubSystemTib: fffff80002c4a000
	      NtTib.Version: 0000000002c4a180
	  NtTib.UserPointer: fffff80002c4a7f0
	      NtTib.SelfTib: 000000007efdb000

	            SelfPcr: 0000000000000000
	               Prcb: fffff80002c4a180
	               Irql: 0000000000000000
	                IRR: 0000000000000000
	                IDR: 0000000000000000
	      InterruptMode: 0000000000000000
	                IDT: 0000000000000000
	                GDT: 0000000000000000
	                TSS: 0000000000000000

	      CurrentThread: fffff80002c5a1c0
	         NextThread: fffffa800586bb50
	         IdleThread: fffff80002c5a1c0

	          DpcQueue:

0: kd> !prcb
PRCB for Processor 0 at fffff80002c4a180:
Current IRQL -- 13
Threads--  Current fffff80002c5a1c0 Next fffffa800586bb50 Idle fffff80002c5a1c0
Processor Index 0 Number (0, 0) GroupSetMember 1
Interrupt Count -- 000174c7
Times -- Dpc    00000012 Interrupt 00000012
         Kernel 00000574 User      00000072

0: kd> dt nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB

0: kd> dt nt!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
   +0x010 NextThread       : Ptr64 _KTHREAD
   +0x018 IdleThread       : Ptr64 _KTHREAD
   +0x020 NestingLevel     : UChar
   +0x021 PrcbPad00        : [3] UChar

```

### Hardware Support

- The other major job of the kernel is to **abstract** or **isolate** the executive and device drivers from variations between the hardware architectures supported by Windows:
  - includes handling variations in functions such as **interrupt handling**, **exception dispatching**, and **multiprocessor synchronization**.
- Some kernel interfaces (such as _spinlock_ routines) are actually implemented in the HAL because their implementation can vary for systems within the same architecture family.
- Other examples of architecture-specific code in the kernel include the interfaces to provide **translation buffer and CPU cache** support. This support requires different code for the different architectures because of the way caches are implemented.
- Another example is **context switching**:
  - Although at a high level the same algorithm is used for thread selection and context switching
